Reports/ПрайсЛистПолотна.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ПрайсЛистПолотна</Name>
		</Properties>
	</Report>
</MetaDataObject>

Catalogs/НастройкиПрайсЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НастройкиПрайсЛиста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтраницаПрайсЛиста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраницыПрайсЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ПрайсЛистПолотна/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СохранитьНастройкиНаСервере()
	НастройкиСКД = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = ЗНАЧЕНИЕ(Справочник.СтраницыПрайсЛиста.Полотна)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НастройкаПрайсЛистаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Иначе
		НастройкаПрайсЛистаОбъект = Справочники.НастройкиПрайсЛиста.СоздатьЭлемент();
		НастройкаПрайсЛистаОбъект.СтраницаПрайсЛиста = Справочники.СтраницыПрайсЛиста.Полотна;
		НастройкаПрайсЛистаОбъект.Наименование = "ПОЛОТНА";
	КонецЕсли;
	
	НастройкаПрайсЛистаОбъект.Настройки = Новый ХранилищеЗначения(НастройкиСКД);
	
	НастройкаПрайсЛистаОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	СтандартнаяОбработка =  Ложь;
	
	// получаем сохранённые настройки, если они есть
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = ЗНАЧЕНИЕ(Справочник.СтраницыПрайсЛиста.Полотна)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Настройки = ВыборкаДетальныеЗаписи.Ссылка.Настройки.Получить();
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;	
	
	//Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
	//	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
	//КонецЕсли;                         
	
	ПараметрПериод = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПериод.Значение = ТекущаяДата();
	ПараметрПериод.Использование = Истина;

	//Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение.Дата = ТекущаяДата();
	
КонецПроцедуры
